In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

········

# 1.How many distinct (different) actors' last names are there?

In [44]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
query = 'SELECT count(distinct last_name) as name_num FROM sakila.actor;'
result1 = pd.read_sql_query(query, engine)
result1.head()

   name_num
0       121

# 2.Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [30]:
query = '''SELECT rental_date, 
WEEKDAY(rental_date) as day,
CASE
WHEN WEEKDAY(rental_date) = 0 OR WEEKDAY(rental_date) = 6 THEN 'weekend'
ELSE 'workday'
END AS day_type
FROM sakila.rental;'''
result2 = pd.read_sql_query(query, engine)
result2.head()

          rental_date  day day_type
0 2005-05-24 22:53:30    1  workday
1 2005-05-24 22:54:33    1  workday
2 2005-05-24 23:03:39    1  workday
3 2005-05-24 23:04:41    1  workday
4 2005-05-24 23:05:21    1  workday

# 3.Get all films with ARMAGEDDON in the title.

In [34]:
query = '''SELECT title FROM sakila.film
WHERE title LIKE '%ARMAGEDDON%';
'''
result3 = pd.read_sql_query(query, engine)
result3.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

# 4.Get 10 the longest films.

In [43]:
query = '''SELECT title,length FROM sakila.film
ORDER BY length DESC
LIMIT 10;
'''
result4 = pd.read_sql_query(query, engine)
result4.head(10)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

# 5.How many films include Behind the Scenes content?

In [41]:
query = '''SELECT COUNT(film_id) as film_num FROM sakila.film
WHERE special_features LIKE '%Behind the Scenes%';
'''
result5 = pd.read_sql_query(query, engine)
result5.head()

   film_num
0       538

# 6.Which kind of movies (rating) have a mean duration of more than two hours?

In [40]:
query = '''SELECT rating,round(avg(length),2) as mean_duration FROM sakila.film
GROUP BY rating
HAVING mean_duration >120;
'''
result6 = pd.read_sql_query(query, engine)
result6.head()

  rating  mean_duration
0  PG-13         120.44

# 7.Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [39]:
query = '''SELECT title,length FROM sakila.film
WHERE length > 0 
ORDER BY length desc;
'''
result7 = pd.read_sql_query(query, engine)
result7.head()

            title  length
0   CHICAGO NORTH     185
1  CONTROL ANTHEM     185
2  DARN FORRESTER     185
3     GANGS PRIDE     185
4       HOME PITY     185